{
  "backend/main.mo": "Motoko canister defining product and order types, a static product list, an orders map, and query functions for retrieving products.",
  "feature_evidence.json": "Feature evidence report listing completed UI removal tasks (email, Facebook) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files, including routing, state, components, and styling.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables for light/dark themes and applying them to body and elements.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, about, products, and contact pages using AppShell as root.",
  "frontend/src/components/cart/CartLineItem.tsx": "Renders a cart item row with image, name, quantity controls, and remove button.",
  "frontend/src/components/cart/StickyCartButton.tsx": "Placeholder component returning null to satisfy module requirements.",
  "frontend/src/components/checkout/CheckoutForm.tsx": "Checkout form managing customer input, validation, and submit handling.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays a summary of cart items and shipping destination without price information.",
  "frontend/src/components/contact/FloatingWhatsAppButton.tsx": "Floating WhatsApp quick-chat button linking to a generated WhatsApp URL.",
  "frontend/src/components/contact/WhatsAppButton.tsx": "Standard WhatsApp button with icon and label linking to a generated WhatsApp URL.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout including header, footer, routed content, and a floating WhatsApp button.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, contact info, social links, and copyright text.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides the main navigation bar with responsive mobile menu, logo, nav links, and publish/share dialog trigger.",
  "frontend/src/components/media/ResponsiveImage.tsx": "Simple wrapper for a responsive lazy-loading image element.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product with image, category label, description, and a WhatsApp contact button.",
  "frontend/src/components/publish/PublishShareDialog.tsx": "Implements a dialog that shows and copies the site's shareable URL.",
  "frontend/src/components/shipping/InternationalShippingCallout.tsx": "Shows a small callout highlighting international shipping availability.",
  "frontend/src/components/shipping/ShippingCountriesList.tsx": "Renders a styled list of countries the business ships to.",
  "frontend/src/constants/contact.ts": "Centralized contact details including phone, WhatsApp, and email info.",
  "frontend/src/constants/copy.ts": "Centralized text constants for navigation, UI labels, shipping, cart, checkout, contact, footer, and publish dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication via Internet Identity, exposing identity state, login, and logout functions.",
  "frontend/src/hooks/useQueries.ts": "Defines product, order, and order-placement queries using the backend actor, including filtering logic for product lists.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with sections describing heritage, quality, and international reach.",
  "frontend/src/pages/CartCheckoutPage.tsx": "Placeholder component that returns null because checkout functionality is removed.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, WhatsApp button, social links, and business hours.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero banner, product highlights, CTAs, and international shipping callouts.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays products with loading/error states and filters out a specific item before rendering.",
  "frontend/src/state/cart/CartContext.tsx": "Provides cart state management including add, update, remove, clear, subtotal, and persistence in sessionStorage.",
  "frontend/src/state/cart/cartSelectors.ts": "Utility functions to calculate line totals and subtotal for cart items.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp message URL using stored contact information and an optional custom message.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and plugin setup using CSS variables.",
  "project_state.json": "Describes the project's shift to a contact‑based site, notes removal of cart/checkout, and lists related runtime issues and missing contact wiring. Also includes existing feature definitions and a flag indicating this is a fix request."
}