{
  "backend/main.mo": "Motoko canister defining product data, order types, in‑memory product list, and query endpoints for fetching products.",
  "feature_evidence.json": "Feature evidence report mapping publishing- and share-related features to involved files, components, and tests.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing each frontend file’s purpose across routing, UI, cart, checkout, and publish/share flows.",
  "frontend/.env.example": "Example env file allowing optional override of the live public site URL for publish/share UI.",
  "frontend/index.css": "Tailwind base layer CSS defining OKLCH-driven color tokens and light/dark theme variables.",
  "frontend/index.html": "Root HTML file bootstrapping the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for Home, About, Products, and Contact using AppShell as the root layout.",
  "frontend/src/components/cart/CartLineItem.tsx": "Renders a cart item row with quantity controls and remove button, without price display.",
  "frontend/src/components/cart/StickyCartButton.tsx": "Placeholder component returning null after cart UI removal.",
  "frontend/src/components/checkout/CheckoutForm.tsx": "Checkout form with local validation for required fields and submit handler.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays a simple list of items and shipping country without pricing.",
  "frontend/src/components/contact/FloatingWhatsAppButton.tsx": "Floating WhatsApp chat button linking to generated WhatsApp URL.",
  "frontend/src/components/contact/WhatsAppButton.tsx": "Inline WhatsApp button showing icon and label using shared URL utility.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper rendering header, routed content, footer, and floating WhatsApp button.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with logo, contact info, social link, and copyright text.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides a responsive header with navigation links, logo, and mobile menu handling.",
  "frontend/src/components/media/ResponsiveImage.tsx": "Simple wrapper for a responsive lazy-loaded image element.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product with image, category label, description, and a WhatsApp contact button.",
  "frontend/src/components/publish/PublishShareDialog.tsx": "Share dialog that shows the public site URL and provides copy-to-clipboard functionality with error handling.",
  "frontend/src/components/shipping/InternationalShippingCallout.tsx": "Shows a small callout indicating that international shipping is available.",
  "frontend/src/components/shipping/ShippingCountriesList.tsx": "Lists supported shipping countries with a styled header and grid layout.",
  "frontend/src/constants/contact.ts": "Defines centralized contact information including phone and email details.",
  "frontend/src/constants/copy.ts": "Centralized text constants for navigation, shipping, cart, checkout, footer, and publish features.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and login/logout management using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching products and orders, filtering product results, and placing orders via an actor API.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the company’s heritage, quality, and international reach.",
  "frontend/src/pages/CartCheckoutPage.tsx": "Placeholder component returning no cart or checkout UI.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information, phone and WhatsApp details, and social media links.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with hero content, CTAs, feature highlights, and shipping info.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays products with loading/error states and a UI-level product filter.",
  "frontend/src/state/cart/CartContext.tsx": "Implements cart state management with add, update, remove, and persistence in sessionStorage.",
  "frontend/src/state/cart/cartSelectors.ts": "Provides utility functions to calculate line totals and cart subtotal.",
  "frontend/src/utils/publicUrl.ts": "Resolves the public site URL using env overrides, runtime origin, and production safeguards.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp messaging URL using configured contact info and an optional custom message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom theme extensions (colors, fonts, shadows, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project state, versioning, architectural notes, known issues, and existing features for a storefront refocus away from cart/checkout flows."
}