{
  "backend/main.mo": "Motoko canister defining product list, order types, and query/update methods with in-memory product data and an orders map.",
  "feature_evidence.json": "Feature evidence report linking a home‑page text update to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files covering routing, state, components, styles, and utilities.",
  "frontend/.env.example": "Example environment file allowing optional override of the public site URL.",
  "frontend/index.css": "Global Tailwind base styles defining color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for Home, About, Products, and Contact using AppShell layout.",
  "frontend/src/components/cart/CartLineItem.tsx": "Renders a cart item row with quantity controls and a remove button, without price display.",
  "frontend/src/components/cart/StickyCartButton.tsx": "Placeholder component returning null since cart button was removed.",
  "frontend/src/components/checkout/CheckoutForm.tsx": "Checkout form handling customer fields, validation, and submit behavior.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Summarizes cart items and selected shipping country without currency values.",
  "frontend/src/components/contact/FloatingWhatsAppButton.tsx": "Floating WhatsApp action button linking to a generated WhatsApp URL.",
  "frontend/src/components/contact/WhatsAppButton.tsx": "Standard WhatsApp button using shared URL utility and copy text.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing header, footer, outlet, and floating WhatsApp button.",
  "frontend/src/components/layout/Footer.tsx": "Renders site footer with logo, contact info, Instagram link, and copyright text.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides responsive site header with navigation links, logo, and publish/share dialog support.",
  "frontend/src/components/media/ResponsiveImage.tsx": "Simple wrapper component for lazy-loaded responsive images.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product with image, category label, description, and a WhatsApp contact button.",
  "frontend/src/components/publish/PublishShareDialog.tsx": "Modal dialog that shows the public site URL and allows copying it with clipboard support.",
  "frontend/src/components/shipping/InternationalShippingCallout.tsx": "Callout box indicating international shipping availability.",
  "frontend/src/components/shipping/ShippingCountriesList.tsx": "Shows a styled list of countries the store ships to.",
  "frontend/src/constants/contact.ts": "Centralized contact details including phone, email, and Instagram info.",
  "frontend/src/constants/copy.ts": "Text constants for navigation, shipping, checkout, footer, and publish features.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching products, product details, orders, and placing orders with filtering and deduping logic for products.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with global styling rules.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing heritage, quality, and international reach with styled content sections.",
  "frontend/src/pages/CartCheckoutPage.tsx": "Placeholder component returning null for a removed cart/checkout feature.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, social links, WhatsApp button, and business hours using constants and icons.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, product highlights, CTAs, and international shipping components.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays filtered product list with loading and error states and a grid of ProductCard components.",
  "frontend/src/state/cart/CartContext.tsx": "Implements cart state with add, update, remove, and persistence in sessionStorage.",
  "frontend/src/state/cart/cartSelectors.ts": "Utility functions to compute cart line totals and subtotal.",
  "frontend/src/utils/publicUrl.ts": "Resolves the public site URL with environment variable override and production safeguards.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp message URL using contact info and optional custom message.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and includes typography, container-queries, and animate plugins.",
  "project_state.json": "Defines the project’s schema, current state, known issues, and existing features, noting the shift away from cart/checkout and deployment/contact-related problems."
}