{
  "kind": "build_request",
  "title": "Publish the current version and provide the live share link",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Publish the current draft/version to the live (production) site so the publicly accessible URL is updated to the latest build and can be shared.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "publish it"
        ]
      },
      "acceptanceCriteria": [
        "The latest deployed version is live in production (not only preview).",
        "The live site loads successfully for an unauthenticated user in a fresh/incognito browser session.",
        "A stable public URL for the live site is available to share."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Ensure the existing in-app Publish/Share UI displays the correct live public URL and supports one-click copy-to-clipboard after publishing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "publish it"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Publish action in the header opens the Share dialog.",
        "The dialog shows the live site URL (not an empty string, and not a localhost URL in production).",
        "Clicking \"Copy Link\" copies the shown URL to the clipboard and provides visible success feedback.",
        "All user-facing text remains in English."
      ]
    }
  ],
  "constraints": [
    "Do not reintroduce cart/checkout flows or any cart context usage.",
    "Do not reintroduce Email or Facebook UI elements that were previously removed.",
    "Do not edit files under frontend/src/components/ui or other frontend immutable paths defined by the platform."
  ],
  "nonGoals": [
    "Adding or configuring a custom domain.",
    "Changing product catalog content, pricing visibility behavior, or contact methods as part of this publish request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}